:PROPERTIES:
:ID:       b239646e-dc8b-4b9a-947a-866a993744a2
:END:
#+title: Personal Finance
#+category: Personal Finance
** Net worth
Usage:
- "-M": by month
- "-e PERIOD_EXPRESSION": end date (exclusive)
#+NAME: Net worth
#+BEGIN_SRC hledger :noweb yes :cmdline bs -X $ -R --infer-market-prices -M ^assets ^liabilities --tree
<<Accounts>>
<<Pricings>>
<<Transactions>>
<<Opening-balances>>
<<Budget>>
#+END_SRC

#+RESULTS: Net worth
#+begin_example
Balance Sheet 2023-01-31, valued at period ends

                             ||    2023-01-31
=============================++===============
 Assets                      ||
-----------------------------++---------------
 Assets                      || $216876.70234
   Octopus                   ||    $292.80000
   Vouchers                  ||   $1550.00000
   Cash                      ||   $1416.00000
   Account Receivable        ||    $549.00000
     Christine               ||    $246.00000
     Jason                   ||    $123.00000
     Wingto Wong             ||    $180.00000
   Brokerage                 ||  $79061.88670
     Firstrade               ||  $72141.60145
       Stock                 ||  $68965.80804
       Cash                  ||   $2741.13891
     Interactive Broker:Cash ||   $6920.28525
   Citi Bank                 ||   $6920.61564
   Joint:Savings             ||     $75184.77
   Personal                  ||  $51901.63000
     Savings:Wedding Ring    ||     $45358.31
     Checking                ||   $6543.32000
-----------------------------++---------------
                             || $216876.70234
=============================++===============
 Liabilities                 ||
-----------------------------++---------------
 Liabilities:Visa Platinum   ||  $10434.30000
-----------------------------++---------------
                             ||  $10434.30000
=============================++===============
 Net:                        || $206442.40234
#+end_example

** Cash flow
#+NAME: Cash flow
#+BEGIN_SRC hledger :noweb yes :cmdline balance -X $ -M --forecast --tree --infer-market-price ^Income ^Expenses
<<Opening-balances>>
<<Accounts>>
<<Pricings>>
<<Transactions>>
#+END_SRC

#+RESULTS: Cash flow
#+begin_example
Balance changes in 2023-01-01..2023-02-28, valued at period ends:

                                 ||           Jan           Feb
=================================++=============================
 Expenses                        ||  $35165.02000             0
   Irregular                     ||  $22013.00000             0
     Gathering                   ||   $1517.00000             0
     Leisure                     ||    $878.00000             0
     Misc                        ||   $1387.00000             0
     Shoes                       ||    $517.00000             0
     Tax                         ||  $17714.00000             0
   Regular                       ||  $13152.02000             0
     Cell Phone                  ||    $127.75000             0
     Dinner                      ||   $1110.00000             0
     Groceries                   ||   $3273.25000             0
       Transport                 ||    $506.50000             0
     Housekeeping money          ||   $7500.00000             0
       Christine                 ||   $3500.00000             0
       Mum                       ||   $4000.00000             0
     Lunch                       ||    $599.00000             0
     Subscriptions               ||     $64.02000             0
     Utilities                   ||    $478.00000             0
 Income                          || $-46382.10000  $-1100.00000
   Salary                        || $-46000.00000             0
   Transportation Subsidy (Govt) ||   $-102.10000             0
   Misc                          ||   $-160.00000             0
   Red Packet                    ||             0  $-1100.00000
   Redpacket                     ||   $-120.00000             0
---------------------------------++-----------------------------
                                 || $-11217.08000  $-1100.00000
#+end_example

*** regular
#+NAME: Regular Budget
#+BEGIN_SRC hledger :noweb yes :cmdline balance tag:generated --forecast -M -b "last month" -e "this month" Expenses:Regular
<<Budget>>
#+END_SRC

#+RESULTS: Regular Budget
#+begin_example
Balance changes in 2023-01:

                                               ||          Jan
===============================================++==============
 Expenses:Regular:Bodybuilding                 ||         $300
 Expenses:Regular:Cell Phone                   ||      $127.75
 Expenses:Regular:Dinner                       ||         $500
 Expenses:Regular:Groceries                    ||        $4300
 Expenses:Regular:Groceries:Transport          ||         $200
 Expenses:Regular:Housekeeping money:Christine ||        $3500
 Expenses:Regular:Housekeeping money:Mum       ||        $4000
 Expenses:Regular:Insurance                    ||         $545
 Expenses:Regular:Lunch                        ||        $1000
 Expenses:Regular:Subscriptions                ||    $64.02000
 Expenses:Regular:Utilities                    ||         $316
-----------------------------------------------++--------------
                                               || $14852.77000
#+end_example

*** irregular
#+NAME: Irregular Budget
#+BEGIN_SRC hledger :noweb yes :cmdline balance tag:generated --forecast -M -b "last month" -e "this month" Irregular
<<Budget>>
#+END_SRC

#+RESULTS: Irregular Budget
#+begin_example
Balance changes in 2023-01:

                              ||   Jan
==============================++=======
 Expenses:Irregular:Books     ||  $150
 Expenses:Irregular:Festival  || $1500
 Expenses:Irregular:Gathering ||  $700
 Expenses:Irregular:Leisure   ||  $600
 Expenses:Irregular:Medical   ||  $500
 Expenses:Irregular:Misc      ||  $500
 Expenses:Irregular:Shoes     ||  $200
 Expenses:Irregular:Tax       || $1794
 Expenses:Irregular:Travel    ||  $200
------------------------------++-------
                              || $6144
#+end_example


**** regular expenses
#+NAME: Regular-Expense-Budget-report
#+BEGIN_SRC hledger :noweb yes :cmdline balance --budget -X $ -E --tree Expenses:Regular not:broker not:Unbudgeted -b "2023" -M
<<Pricings>>
<<Budget>>
<<Transactions>>
<<Opening-balances>>
#+END_SRC

#+RESULTS: Regular-Expense-Budget-report
#+begin_example
Budget performance in 2023-01-01..2023-02-28, valued at period ends:

                      ||                                 Jan                                 Feb
======================++=========================================================================
 Expenses:Regular     || $13733.04000 [ 92% of $14852.77000]  $3614.13000 [ 24% of $14852.77000]
   Bodybuilding       ||            0 [  0% of         $300]            0 [  0% of         $300]
   Cell Phone         ||   $127.75000 [100% of      $127.75]   $127.75000 [100% of      $127.75]
   Dinner             ||  $1110.00000 [222% of         $500]   $452.00000 [ 90% of         $500]
   Groceries          ||  $3854.27000 [ 86% of        $4500]  $1649.63000 [ 37% of        $4500]
     Transport        ||   $506.50000 [253% of         $200]            0 [  0% of         $200]
   Housekeeping money ||  $7500.00000 [100% of        $7500]            0 [  0% of        $7500]
     Christine        ||  $3500.00000 [100% of        $3500]            0 [  0% of        $3500]
     Mum              ||  $4000.00000 [100% of        $4000]            0 [  0% of        $4000]
   Insurance          ||            0 [  0% of         $545]   $521.75000 [ 96% of         $545]
   Lunch              ||   $599.00000 [ 60% of        $1000]   $677.00000 [ 68% of        $1000]
   Subscriptions      ||    $64.02000 [100% of    $64.02000]            0 [  0% of    $64.02000]
   Utilities          ||   $478.00000 [151% of         $316]   $186.00000 [ 59% of         $316]
----------------------++-------------------------------------------------------------------------
                      || $13733.04000 [ 92% of $14852.77000]  $3614.13000 [ 24% of $14852.77000]
#+end_example
**** irregular expenses
#+NAME: Cumulative-Irregular-Expense-Budget-report
#+BEGIN_SRC hledger :noweb yes :cmdline balance -X $ --budget --cumulative --tree Expenses:Irregular not:broker not:Unbudgeted -b "this year" -M
<<Pricings>>
<<Budget>>
<<Transactions>>
#+END_SRC

#+RESULTS: Cumulative-Irregular-Expense-Budget-report
#+begin_example
Budget performance in 2023-01-01..2023-02-28, valued at period ends:

                    ||                   2023-01-31                     2023-02-28
====================++=============================================================
 Expenses:Irregular || $22013.00000 [358% of $6144]  $23154.90000 [188% of $12288]
   Books            ||            0 [  0% of  $150]             0 [  0% of   $300]
   Festival         ||            0 [  0% of $1500]    $769.90000 [ 26% of  $3000]
   Gathering        ||  $1517.00000 [217% of  $700]   $1517.00000 [108% of  $1400]
   Leisure          ||   $878.00000 [146% of  $600]    $878.00000 [ 73% of  $1200]
   Medical          ||            0 [  0% of  $500]             0 [  0% of  $1000]
   Misc             ||  $1387.00000 [277% of  $500]   $1387.00000 [139% of  $1000]
   Shoes            ||   $517.00000 [258% of  $200]    $517.00000 [129% of   $400]
   Tax              || $17714.00000 [987% of $1794]  $17714.00000 [494% of  $3588]
   Travel           ||            0 [  0% of  $200]    $372.00000 [ 93% of   $400]
--------------------++-------------------------------------------------------------
                    || $22013.00000 [358% of $6144]  $23154.90000 [188% of $12288]
#+end_example

**** savings
#+NAME: Saving-Budget-report
#+BEGIN_SRC hledger :noweb yes :cmdline balance -MB -X $ --budget --cumulative --tree Savings not:broker not:Unbudgeted -b 2023
<<Pricings>>
<<Budget>>
<<Transactions>>
#+END_SRC

#+RESULTS: Saving-Budget-report
#+begin_example
Budget performance in 2023-01-01..2023-02-28, converted to cost, valued at period ends:

                    ||                         2023-01-31                          2023-02-28
====================++========================================================================
 Assets             || $18686.01000 [73% of $25503.23000]  $13336.01000 [26% of $51006.46000]
   Joint:Savings    || $18686.01000 [93% of $20003.23000]  $13336.01000 [33% of $40006.46000]
   Personal:Savings ||            0 [ 0% of  $5500.00000]             0 [ 0% of $11000.00000]
     Investments    ||            0 [ 0% of  $2000.00000]             0 [ 0% of  $4000.00000]
     Wedding Ring   ||            0 [ 0% of  $3500.00000]             0 [ 0% of  $7000.00000]
--------------------++------------------------------------------------------------------------
                    || $18686.01000 [73% of $25503.23000]  $13336.01000 [26% of $51006.46000]
#+end_example

** Register
#+NAME: Register
#+BEGIN_SRC hledger :noweb yes :cmdline register Travel
<<Opening-balances>>
<<Accounts>>
<<Pricings>>
<<Assets>>
<<Transactions>>
#+END_SRC

#+RESULTS: Register
: 2023-01-30 Travel hotel         Un:Ex:Ir:Travel        $1457.99000   $1457.99000
: 2023-02-08 USJ                  Un:Expenses:Travel     $1350.00000   $2807.99000
: 2023-02-13 USJ fast pass        Un:Ex:Ir:Travel        $2048.00000   $4855.99000
: 2023-02-17 Bag                  Ex:Irregular:Travel     $372.00000   $5227.99000

* Archives
[[https://www.ledger-cli.org/3.0/doc/ledger3.html#Archiving-Previous-Years][tutorial]]
1. copy the transactions here
2. execute and get the closing and opening balance
3.


#+BEGIN_SRC hledger :noweb yes :cmdline close -X $
<<Pricings>>
#+end_src

#+RESULTS:
#+begin_example
2023-01-01 opening balances
    Assets:Account Receivable:Christine              $-369.00000 = $-369.00000
    Assets:Account Receivable:Jason                  $-246.00000 = $-246.00000
    Assets:Brokerage:Firstrade                        $434.65450 = $434.65450
    Assets:Brokerage:Firstrade:Cash                  $4346.78050 = $4346.78050
    Assets:Brokerage:Firstrade:Stock            $64706.556277135 = $64706.556277135
    Assets:Brokerage:Firstrade:Stock                      5 VTIP = 5 VTIP
    Assets:Brokerage:Interactive Broker:Cash         $6920.28525 = $6920.28525
    Assets:Cash                                       $340.00000 = $340.00000
    Assets:Joint:Savings                            $71436.77000 = $71436.77000
    Assets:Octopus                                    $292.80000 = $292.80000
    Assets:Personal:Checking                        $-2090.68000 = $-2090.68000
    Assets:Personal:Savings                          $-986.00000 = $-986.00000
    Assets:Personal:Savings:Investments              $2000.00000 = $2000.00000
    Assets:Personal:Savings:Wedding Ring            $46862.00000 = $46862.00000
    Assets:Reimbursement:Medical                     $-798.00000 = $-798.00000
    Assets:Vouchers                                  $1700.00000 = $1700.00000
    Liabilities:Visa Platinum                       $-7898.40000 = $-7898.40000
    equity:opening/closing balances
#+end_example

*** Budget
#+NAME: Budget-2022
#+BEGIN_SRC ledger :cmdline balance
; 2022/09/01  * Monthly budget
~ monthly from 2022/10/01  * Monthly budget update
    Expenses:Lunch  $1000
    Assets:Joint:Savings
~ monthly from 2022/09  * Monthly budget
    Expenses:Lunch  $500
    Expenses:Dinner  $500
    Expenses:Gathering  $800
    Expenses:Books  $150
    Expenses:Subscriptions   $64.02000
    Expenses:Cell Phone  $186
    Expenses:Medical  $500
    Expenses:Bodybuilding  $500
    Expenses:Housekeeping money:Mum  $4000
    Expenses:Housekeeping money:Christine  $3500
    Expenses:Leisure  $250
    Expenses:Misc  $500
    Expenses:Travel  $100
    Expenses:Festival  $1000
    Expenses:Insurance  $545
    Expenses:Utilities  $316
    Expenses:Groceries  $4000
    Expenses:Tax  $1794
    Expenses:Travel  $100
    Income:Salary  -$46500
    Assets:Personal:Savings:Investments  $2000
    Assets:Personal:Savings:Wedding Ring  $3500
    Assets:Joint:Savings
#+END_SRC

#+RESULTS: Budget

#+NAME: Expense-Budget-report-2022
#+BEGIN_SRC hledger :noweb yes :cmdline balance -MB --budget -X $ -E --cumulative --tree -b 2022-09-01 Expenses not:broker not:Unbudgeted
<<Pricings>>
<<Budget-2022>>
<<Transactions-2022>>
<<Expense-Budget-report-adjustments>>
#+END_SRC

#+NAME: Expense-Budget-report-2022
#+BEGIN_SRC hledger :noweb yes :cmdline balance -MB --budget -X $ -E --tree -b 2022-09-01 Expenses not:broker not:Unbudgeted
<<Pricings>>
<<Budget-2022>>
<<Transactions-2022>>
<<Expense-Budget-report-adjustments>>
#+END_SRC

#+NAME: Average-spending-2022
#+BEGIN_SRC hledger :noweb yes :cmdline balance -MA -b 2022-08-01 -e 2022-12-31 --depth 2 Expenses
<<Transactions-2022>>
#+END_SRC

#+RESULTS: Average-spending-2022
#+begin_example
Balance changes in 2022-08-01..2022-12-31:

                             ||                   Aug        Sep        Oct       Nov        Dec               Average
=============================++========================================================================================
 Expenses:Bodybuilding       ||               $195.00    $258.00    $142.00   $123.00          0               $143.60
 Expenses:Books              ||               $399.04          0    $270.00         0          0               $133.81
 Expenses:Cell Phone         ||               $186.00    $186.00    $372.00   $186.00          0               $186.00
 Expenses:Dinner             ||               $314.00    $220.00    $211.00   $678.90    $344.00               $353.58
 Expenses:Festival           ||                     0   $1358.20          0   $927.00   $4248.80              $1306.80
 Expenses:Gathering          ||              $2033.20    $368.00    $327.00         0          0               $545.64
 Expenses:Groceries          ||              $5797.68   $2006.60   $5610.00  $5161.32   $5180.23              $4751.17
 Expenses:Housekeeping money ||                     0   $7000.00  $14500.00         0  $15000.00              $7300.00
 Expenses:Insurance          ||                     0   $1700.00          0   $600.00    $600.00               $580.00
 Expenses:Interactive Broker ||    $15.70, USD 13.980          0          0         0          0      $3.14, USD 2.796
 Expenses:Leisure            ||              $1968.00    $438.00     $13.70         0    $488.00               $581.54
 Expenses:Lunch              ||               $446.00   $1492.00    $736.00  $1021.00    $428.90               $824.78
 Expenses:Medical            ||             $10320.00          0    $300.00         0          0              $2124.00
 Expenses:Misc               ||              $1315.00    $360.00          0   $123.00          0               $359.60
 Expenses:Subscriptions      ||                $64.02     $64.02     $64.02    $64.02          0                $51.22
 Expenses:Utilities          ||               $316.00    $108.00    $316.00         0    $316.00               $211.20
 Unbudgeted:Expenses         ||                     0          0  $15817.00   $550.00          0              $3273.40
-----------------------------++----------------------------------------------------------------------------------------
                             || $23369.64, USD 13.980  $15558.82  $38678.72  $9434.24  $26605.93  $22729.47, USD 2.796
#+end_example


#+RESULTS: Expense-Budget-report-2022
#+begin_example
Budget performance in 2022-09-01..2022-12-31, converted to cost, valued at period ends:

                      ||                          2022-09-30                           2022-10-31                           2022-11-30                           2022-12-31
======================++====================================================================================================================================================
 Expenses             || $15558.82000 [ 80% of $19432.77000]  $38420.54000 [ 96% of $39865.54000]  $47304.78000 [ 78% of $60298.31000]  $73910.71000 [ 92% of $80731.08000]
   Bodybuilding       ||   $258.00000 [ 52% of   $500.00000]    $400.00000 [ 40% of  $1000.00000]    $523.00000 [ 35% of  $1500.00000]    $523.00000 [ 26% of  $2000.00000]
   Books              ||            0 [  0% of   $150.00000]    $270.00000 [ 90% of   $300.00000]    $270.00000 [ 60% of   $450.00000]    $270.00000 [ 45% of   $600.00000]
   Cell Phone         ||   $186.00000 [ 59% of   $313.75000]    $558.00000 [ 89% of   $627.50000]    $744.00000 [ 79% of   $941.25000]    $744.00000 [ 59% of  $1255.00000]
   Dinner             ||   $220.00000 [ 44% of   $500.00000]    $431.00000 [ 43% of  $1000.00000]   $1109.90000 [ 74% of  $1500.00000]   $1453.90000 [ 73% of  $2000.00000]
   Festival           ||  $1358.20000 [136% of  $1000.00000]   $1358.20000 [ 68% of  $2000.00000]   $2285.20000 [ 76% of  $3000.00000]   $6534.00000 [163% of  $4000.00000]
   Gathering          ||   $368.00000 [ 46% of   $800.00000]    $695.00000 [ 43% of  $1600.00000]    $695.00000 [ 29% of  $2400.00000]    $695.00000 [ 22% of  $3200.00000]
   Groceries          ||  $2006.60000 [ 50% of  $4000.00000]   $7616.60000 [ 95% of  $8000.00000]  $12777.92000 [106% of $12000.00000]  $17958.15000 [112% of $16000.00000]
   Housekeeping money ||  $7000.00000 [ 93% of  $7500.00000]  $21500.00000 [143% of $15000.00000]  $21500.00000 [ 96% of $22500.00000]  $36500.00000 [122% of $30000.00000]
     Christine        ||  $3000.00000 [ 86% of  $3500.00000]  $10000.00000 [143% of  $7000.00000]  $10000.00000 [ 95% of $10500.00000]  $17000.00000 [121% of $14000.00000]
     Mum              ||  $4000.00000 [100% of  $4000.00000]  $11500.00000 [144% of  $8000.00000]  $11500.00000 [ 96% of $12000.00000]  $19500.00000 [122% of $16000.00000]
   Insurance          ||  $1700.00000 [312% of   $545.00000]   $1700.00000 [156% of  $1090.00000]   $2300.00000 [141% of  $1635.00000]   $2900.00000 [133% of  $2180.00000]
   Leisure            ||   $438.00000 [175% of   $250.00000]    $451.70000 [ 90% of   $500.00000]    $451.70000 [ 60% of   $750.00000]    $939.70000 [ 94% of  $1000.00000]
   Lunch              ||  $1492.00000 [298% of   $500.00000]   $2228.00000 [111% of  $2000.00000]   $3249.00000 [ 93% of  $3500.00000]   $3677.90000 [ 74% of  $5000.00000]
   Medical            ||            0 [  0% of   $500.00000]    $300.00000 [ 30% of  $1000.00000]    $300.00000 [ 20% of  $1500.00000]    $300.00000 [ 15% of  $2000.00000]
   Misc               ||   $360.00000 [ 72% of   $500.00000]    $360.00000 [ 36% of  $1000.00000]    $483.00000 [ 32% of  $1500.00000]    $483.00000 [ 24% of  $2000.00000]
   Subscriptions      ||    $64.02000 [100% of    $64.02000]    $128.04000 [100% of   $128.04000]    $192.06000 [100% of   $192.06000]    $192.06000 [ 75% of   $256.08000]
   Tax                ||            0 [  0% of  $1794.00000]             0 [  0% of  $3588.00000]             0 [  0% of  $5382.00000]             0 [  0% of  $7176.00000]
   Travel             ||            0 [  0% of   $200.00000]             0 [  0% of   $400.00000]             0 [  0% of   $600.00000]             0 [  0% of   $800.00000]
   Utilities          ||   $108.00000 [ 34% of   $316.00000]    $424.00000 [ 67% of   $632.00000]    $424.00000 [ 45% of   $948.00000]    $740.00000 [ 59% of  $1264.00000]
----------------------++----------------------------------------------------------------------------------------------------------------------------------------------------
                      || $15558.82000 [ 80% of $19432.77000]  $38420.54000 [ 96% of $39865.54000]  $47304.78000 [ 78% of $60298.31000]  $73910.71000 [ 92% of $80731.08000]
#+end_example

#+NAME: Expense-Budget-report-adjustments
#+begin_src hledger
# Adjustments to make the balance start from 0
2022/08/28 * Opening balance
    Expenses:Lunch  =$0
    Expenses:Dinner  =$0
    Expenses:Gathering  =$0
    Expenses:Books  =$0
    Expenses:Subscriptions   =$0
    Expenses:Cell Phone  =$0
    Expenses:Medical  =$0
    Expenses:Protein diet  =$0
    Expenses:Leisure  =$0
    Expenses:Misc  =$0
    Expenses:Utilities  =$0
    Expenses:Groceries  =$0
    Equity:Opening Balance


#+end_src

#+NAME: Savings-Budget-report
#+BEGIN_SRC hledger :noweb yes :cmdline balance -MB --budget -X $ -E --tree --cumulative -e 2022-10 Assets:Personal:Savings
<<Pricings>>
<<Budget>>
<<Transactions>>

# Adjustments to make the balance start from 0
2022/08/28 * Opening balance
    Assets:Personal:Savings:Investments  =$0
    Assets:Personal:Savings:Wedding Ring  =$0
    Equity:Opening Balance
#+END_SRC

#+RESULTS: Savings-Budget-report
: Budget performance in 2022-08-01..2022-09-30, converted to cost, valued at period ends:
:
:                          || 2022-08-31                       2022-09-30
: =========================++=============================================
:  Assets:Personal:Savings ||          0  $626.00000 [12% of $5372.25000]
:    Investments           ||          0           0 [ 0% of $2000.00000]
:    Wedding Ring          ||          0  $812.00000 [23% of $3500.00000]
: -------------------------++---------------------------------------------
:                          ||          0  $626.00000 [12% of $5372.25000]
